cask "1password"
cask "anki"
cask "arc"
cask "autodesk-fusion"
cask "chatgpt"
cask "cleanshot"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "displaylink"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "lunar"
cask "makemkv"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-word"
cask "mkvtoolnix"
cask "notion"
cask "obsidian"
cask "pgadmin4"
cask "qbittorrent"
cask "qflipper"
cask "raycast"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"
cask "zulip"
