tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "bat"
brew "cmake"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "krb5"
brew "lazygit"
brew "mas"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "nvm"
brew "oh-my-posh"
brew "pkg-config"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "wget"
brew "yank"
brew "zoxide"
