cask "1password"
cask "aerospace"
cask "alacritty"
cask "anki"
cask "arc"
cask "arduino-ide"
cask "autodesk-fusion"
cask "chatgpt"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "displaylink"
cask "docker"
cask "figma"
cask "firefox"
cask "font-symbols-only-nerd-font"
cask "gather"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "kindle"
cask "lunar"
cask "makemkv"
cask "mkvtoolnix"
cask "notion"
cask "obsidian"
cask "pgadmin4"
cask "qbittorrent"
cask "qflipper"
cask "qmk-toolbox"
cask "raycast"
cask "slack"
cask "spotify"
cask "synthesia"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"
cask "zulip"
