tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "supabase/tap"

brew "bat"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "dfu-util"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libyaml"
brew "lua"
brew "luarocks"
brew "mas"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "oh-my-posh"
brew "pkg-config"
brew "platformio"
brew "poppler"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tmux"
brew "wget"
brew "yank"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "supabase/tap/supabase"
