tap "nikitabobko/tap"
tap "supabase/tap"

brew "bat"
brew "cmake"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libyaml"
brew "lua"
brew "luarocks"
brew "mas"
brew "mdformat"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "oh-my-posh"
brew "pipx"
brew "pkg-config"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"
brew "wget"
brew "xan"
brew "yank"
brew "yazi"
brew "zoxide"
brew "supabase/tap/supabase"
