cask "1password"
cask "anki"
cask "arc"
cask "autodesk-fusion"
cask "balenaetcher"
cask "bambu-studio"
cask "chatgpt"
cask "cleanshot"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "displaylink"
cask "docker-desktop"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "google-earth-pro"
cask "iina"
cask "keymapp"
cask "linear-linear"
cask "loom"
cask "lunar"
cask "makemkv"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-word"
cask "mullvad-vpn"
cask "notion"
cask "obsidian"
cask "orcaslicer"
cask "pgadmin4"
cask "qbittorrent"
cask "qflipper"
cask "raycast"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"
cask "zen"
cask "zulip"
cask "zwift"
